---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkType.IsFromRevitServer
source: html/514f1781-700e-558c-70c9-c9328139da6c.htm
---
# Autodesk.Revit.DB.RevitLinkType.IsFromRevitServer Method

Checks whether the Revit link is located on Revit Server.

## Syntax (C#)
```csharp
public bool IsFromRevitServer()
```

## Returns
Returns true if the Revit link is located on Revit Server.